void setup(){
  size(800,600);
  PFont font = createFont("標楷體",16);
  textFont(font);
}
String [] faces = {
  "黑桃A","黑桃2","黑桃3","黑桃4","黑桃5","黑桃6","黑桃7","黑桃8","黑桃9","黑桃10","黑桃J","黑桃Q","黑桃K",
  "黑桃A","黑桃2","黑桃3","黑桃4","黑桃5","黑桃6","黑桃7","黑桃8","黑桃9","黑桃10","黑桃J","黑桃Q","黑桃K",
  "黑桃A","黑桃2","黑桃3","黑桃4","黑桃5","黑桃6","黑桃7","黑桃8","黑桃9","黑桃10","黑桃J","黑桃Q","黑桃K",
  "黑桃A","黑桃2","黑桃3","黑桃4","黑桃5","黑桃6","黑桃7","黑桃8","黑桃9","黑桃10","黑桃J","黑桃Q","黑桃K"};
void draw(){
 background(#FFFFF2);
 for(int i =0;i<52;i++){
   int x = (i%13)*60;
   int y = int(i/13)*120;
   fill(255);rect(x,y,60,120);
   if(faces[i].indexOf("红心")==-1 && faces[i].indexOf("方塊")==-1)fill(0);
   else fill(255,0,0);
   text(faces[i],x+10,y+60);
  }
}
